{
  "title" : "Multiphase Flow of Immiscible Fluids on Unstructured Moving Meshes.",
  "authors" : ["Marek. K. Misztal", "Kenny Erleben", "Adam Bargteil", "Jens Fursund", "Brian Bunch Christensen", "Jakob Andreas. Bærentzen", "Robert Bridson"],
  "abstract" : "In this paper, we present a method for animating multiphase flow of immiscible fluids using unstructured moving meshes. Our underlying discretization is an unstructured tetrahedral mesh, the deformable simplicial complex (DSC), that moves with the flow in a Lagrangian manner. Mesh optimization operations improve element quality and avoid element inversion. In the context of multiphase flow, we guarantee that every element is occupied by a single fluid and, consequently, the interface between fluids is represented by a set of faces in the simplicial complex. This approach ensures that the underlying discretization matches the physics and avoids the additional book-keeping required in grid-based methods where multiple fluids may occupy the same cell. Our Lagrangian approach naturally leads us to adopt a finite element approach to simulation, in contrast to the finite volume approaches adopted by a majority of fluid simulation techniques that use tetrahedral meshes. We characterize fluid simulation as an optimization problem allowing for full coupling of the pressure and velocity fields and the incorporation of a second-order surface energy. We introduce a preconditioner based on the diagonal Schur complement and solve our optimization on the GPU. We provide the results of parameter studies as well as a performance analysis of our method.",
  "video-link" : ["https://youtu.be/DqrMcpwyGYY", "https://youtu.be/xU5VUOkESF8", "https://youtu.be/m5kKAd9T5Zg", "https://youtu.be/kRQ-jGQ0CBE", "https://youtu.be/Lb8cgdg6Mbo", "https://youtu.be/tRox5HD5JNw", "https://youtu.be/8OW_MCeRybY", "https://youtu.be/Q4mX3QfjSf8", "https://youtu.be/M6MjR_bh8ig", "https://youtu.be/yyn7DCtxKzY", "https://youtu.be/W_0rmBBr05A", "https://youtu.be/PbDwai7x-U4", "https://youtu.be/o-1M52E2Er8", "https://youtu.be/nxM6_Fd9xvM", "https://youtu.be/t6sovbciVpw"],
  "venue" : "Proceedings of the ACM SIGGRAPH/Eurographics Symposium on Computer Animation, Pages 97-106.",
  "publisher-link": "http://dl.acm.org/citation.cfm?id=2422356.2422372",
  "paper-link" : "misztal.ea12.pdf",
  "icon-link" : "misztal.ea12.png",
  "month" : "July",
  "year" : "2012",
  "prize": "SCA best paper award on fluid animation.",
  "corresponding": "True",
  "reviewed": "True",
  "type": "conference",
  "BFI": "2"
}


