{
  "title" : "Interactive Simulation of Rigid Body Dynamics in Computer Graphics.",
  "authors" : ["Jan Bender", "Kenny Erleben", "Jeff Trinkle", "Erwin Coumans"],
  "abstract" : "Interactive rigid body simulation is an important part of many modern computer tools. No authoring tool nor a game engine can do without. The high performance computer tools open up new possibilities for changing how designers, engineers, modelers and animators work with their design problems. This paper is a self contained state-of-the-art report on the physics, the models, the numerical methods and the algorithms used in interactive rigid body simulation all of which has evolved and matured over the past 20 years. The paper covers applications and the usage of interactive rigid body simulation. Besides the mathematical and theoretical details that this paper communicates in a pedagogical manner the paper surveys common practice and reflects on applications of interactive rigid body simulation. The grand merger of interactive and off-line simulation methods is imminent, multi-core is everyman’s property. These observations pose future challenges for research which we reflect on. In perspective several avenues for possible future work is touched upon such as more descriptive models and contact point generation problems. This paper is not only a stake in the sand on what has been done, it also seeks to give newcomers practical hands on advices and reflections that can give experienced researchers afterthought for the future.",
  "venue" : "EUROGRAPHICS 2012 State of the Art Reports, Eurographics Association, Cagliari, Sardinia, Italy.",
  "paper-link" : "https://diglib.eg.org/bitstream/handle/10.2312/conf.EG2012.stars.095-134/095-134.pdf?sequence=1&isAllowed=y",
  "publisher-link": "https://diglib.eg.org/handle/10.2312/conf.EG2012.stars.095-134",
  "doi-link" : "http://dx.doi.org/10.2312/conf/EG2012/stars/095-134",
  "icon-link" : "bender.ea12.png",
  "month" : "July",
  "year" : "2012",
  "corresponding": "True",
  "reviewed": "True",
  "type": "star paper",
  "BFI": "None"
}
