{
  "title" : "A systematic comparison between FEBio and PolyFEM for biomechanical systems.",
  "authors" : ["Liam Martin", "Pranav Jain", "Zachary Ferguson", "Torkan Gholamalizadeh", "Faezeh Moshfeghifar", "Kenny Erleben", "Daniele Panozzo", "Steven Abramowitch", "Teseo Schneider"],
  "venue" : ",Computer Methods and Programs in Biomedicine. Volume 224.",
  "doi-link" : "https://doi.org/10.1016/j.cmpb.2023.107938",
  "publisher-link": "https://www.sciencedirect.com/science/article/pii/S0169260723006041",
  "icon-link" : "martin.ea24.png",
  "paper-link" : "martin.ea24.pdf",
  "month" : "February",
  "year" : "2024",
  "corresponding": "False",
  "reviewed": "True",
  "type": "journal",
  "abstract" : "Background and Objectives\nFinite element simulations are widely employed as a non-invasive and cost-effective approach for predicting outcomes in biomechanical simulations. However, traditional finite element software, primarily designed for engineering materials, often encountered limitations in contact detection and enforcement, leading to simulation failure when dealing with complex biomechanical configurations. Currently, a lot of model tuning is required to get physically accurate finite element simulations without failures. This adds significant human interaction to each iteration of a biomechanical model. This study addressed these issues by introducing PolyFEM, a novel finite element solver that guarantees inversion- and intersection-free solutions with completely automatic collision detection. The objective of this research is to validate PolyFEM's capabilities by comparing its results with those obtained from a well-established finite element solver, FEBio.\nMethods\nTo achieve this goal, five comparison scenarios were formulated to assess and validate PolyFEM's performance. The simulations were reproduced using both PolyFEM and FEBio, and the final results were compared. The five comparison scenarios included: (1) reproducing simulations from the FEBio test suite, consisting of static, dynamic, and contact-driven simulations; (2) replicating simulations from the verification paper published alongside the original release of FEBio; (3) a biomechanically based contact problem; (4) creating a custom simulation involving high-energy collisions between soft materials to highlight the difference in collision methods between the two solvers; and (5) performing biomechanical simulations of biting and quasi-stance.\nResults\nWe found that PolyFEM was capable of replicating all simulations previously conducted in FEBio. Particularly noteworthy is PolyFEM's superiority in high-energy contact simulations, where FEBio fell short, unable to complete over half of the simulations in Scenario 4. Although some of the simulations required significantly more simulation time in PolyFEM compared to FEBio, it is important to highlight that PolyFEM achieved these results without the need for any additional model tuning or contact declaration.\nDiscussion\nDespite being in the early stages of development, PolyFEM currently provides verified solutions for hyperelastic materials that are consistent with FEBio, both in previously published workflows and novel finite element scenarios. PolyFEM exhibited the ability to tackle challenging biomechanical problems where other solvers fell short, thus offering the potential to enhance the accuracy and realism of future finite element analyses.\nKeywords: Finite element analysis; Large deformation; Contact; Benchmark; Finite element verification."
}
