{
  "title" : "A joint-constraint model for human joints using signed distance-fields.",
  "authors" : ["Morten Engell-Nørregård", "Sarah Niebe", "Kenny Erleben"],
  "abstract" : "We present a local joint-constraint model for a single joint which is based on distance fields. Our model is fast, general, and well suited for modeling human joints. In this work, we take a geometric approach and model the geometry of the boundary of the feasible region, i.e., the boundary of all allowed poses. A region of feasible poses can be built by embedding motion captured data points in a signed distance field. The only assumption is that the feasible poses form a single connected set of angular values. We show how signed distance fields can be used to generate fast and general joint-constraint models for kinematic figures. Our model is compared to existing joint-constraint models, both in terms of generality and computational cost. The presented method supports joint-constraints of up to three degrees of freedom and works well with sampled motion data. Our model can be extended to handle inter-joint dependencies, or joints with more than three degrees of freedom. The resolution of the joint-constraints can be tweaked individually for each degree of freedom, which can be used to optimize memory usage. We perform a comparative study of the key-properties of various joint-constraint models, as well as a performance study of our model compared to the fastest alternative, the box limit model. The study is performed on the shoulder joint, using a motion captured jumping motion as reference.",
  "publisher-link": "https://link.springer.com/article/10.1007%2Fs11044-011-9296-1",
  "research-gate-link": "https://www.researchgate.net/publication/257627697_A_joint-constraint_model_for_human_joints_using_signed_distance-fields.",
  "venue" : "Multibody System Dynamics, Volume 28, Pages 69–81.",
  "video-link" : "http://youtu.be/8c2O9Cjkg9w",
  "month" : "January",
  "year" : "2012",
  "doi-link" : "https://doi.org/10.1007/s11044-011-9296-1",
  "icon-link" : "engell.noerregaard.ea12.png",
  "paper-link" : "engell.noerregaard.ea12.pdf",
  "corresponding": "True",
  "reviewed": "True",
  "type": "journal",
  "BFI": "2"
}
