{
  "title" : "Contact and friction simulation for computer graphics",
  "authors" : "Sheldon Andrews, Kenny Erleben",
  "venue" : "SIGGRAPH '21: ACM SIGGRAPH 2021 Courses, August 2021, Article No.: 2, Pages 1–124",
  "abstract" : "Efficient simulation of contact is of interest for numerous physics-based animation applications. For instance, virtual reality training, video games, rapid digital prototyping, and robotics simulation are all examples of applications that involve contact modeling and simulation. However, despite its extensive use in modern computer graphics, contact simulation remains one of the most challenging problems in physics-based animation. This course covers fundamental topics on the nature of contact modeling and simulation for computer graphics. Specifically, we provide mathematical details about formulating contact as a complementarity problem in rigid body and soft body animations. We briefly cover several approaches for contact generation using discrete collision detection. Then, we present a range of numerical techniques for solving the associated LCPs and NCPs. The advantages and disadvantages of each technique are further discussed in a practical manner, and best practices for implementation are discussed. Finally, we conclude the course with several advanced topics, such as anisotropic friction modeling and proximal operators. Programming examples are provided on the course website to accompany the course notes.",
  "doi-link" : "https://doi.org/10.1145/3450508.3464571",
  "video-link" : "https://www.youtube.com/watch?v=5JZ-tYHsJKg",
  "web-link" : "https://siggraphcontact.github.io/",
  "paper-link" : "https://profs.etsmtl.ca/sandrews/pdf/textureFriction_SCA21_preprint.pdf",
  "code-link" : "https://github.com/sheldona/contactFrictionSim",
  "publisher-link": "https://dl.acm.org/doi/10.1145/3450508.3464571",
  "icon-link" : "andrews.erleben.21.png",
  "month" : "July",
  "year" : "2021"
}

Teaser
New method for interactive simulation of large stacks of rigid bodies

Subjects
Digital Prototyping & Computational Contact Mechanics


Title
Velocity-based Shock Propagation for Multibody Dynamics Animation

Author
Kenny Erleben

Abstract
Multibody dynamics are used in interactive and real-time applications, ranging from computer games to virtual prototyping, and engineering. All these areas strive towards faster and larger scale simulations. Particularly challenging are large-scale simulations with highly organized and structured stacking. We present a stable, robust, and versatile method for multibody dynamics simulation. Novel contributions include a new, explicit, fixed time-stepping scheme for velocity-based complementarity formulations using shock propagation with a simple reliable implementation strategy for an iterative complementarity problem solver specifically optimized for multibody dynamics.

Video
https://youtu.be/fT-aD_xUI9I?list=PLNtAp--NfuioNyOrPiZ0O1i9cUnx4jeeh

BibTex

@article{erleben.07,
 author = {Erleben, Kenny},
 title = {Velocity-based Shock Propagation for Multibody Dynamics Animation},
 journal = {ACM Trans. Graph.},
 issue_date = {June 07},
 volume = {26},
 number = {2},
 month = jun,
 year = {2007},
 issn = {0730-0301},
 articleno = {12},
 url = {http://doi.acm.org/10.1145/1243980.1243986},
 doi = {10.1145/1243980.1243986},
 acmid = {1243986},
 publisher = {ACM},
 address = {New York, NY, USA},
 keywords = {Multibody dynamics, complementarity formulations, constraint-based simulation, shock-propagation, stacking},
} 
